spec/fixtures/cancel_success.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.sandbox.midtrans.com/v2/charge
    body:
      encoding: UTF-8
      string: '{"payment_type":"permata","transaction_details":{"order_id":1554317097,"gross_amount":100000}}'
    headers:
      User-Agent:
      - Veritrans ruby gem 2.3.0
      Authorization:
      - Basic VlQtc2VydmVyLTlIdGItUnhYa2c3LTdoem5TQ0NqeHZvWTo=
      Accept:
      - application/json
      Content-Type:
      - application/json
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 03 Apr 2019 18:44:57 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '432'
      Connection:
      - keep-alive
      Vary:
      - Accept-Encoding
      Cache-Control:
      - no-cache
      Pragma:
      - no-cache
      Expires:
      - Wed, 31 Dec 1969 17:00:00 GMT
      X-Kong-Upstream-Latency:
      - '200'
      X-Kong-Proxy-Latency:
      - '0'
      Via:
      - kong/0.14.0
      Strict-Transport-Security:
      - max-age=15724800; includeSubDomains;
    body:
      encoding: ASCII-8BIT
      string: |-
        {
          "status_code" : "201",
          "status_message" : "Success, PERMATA VA transaction is successful",
          "transaction_id" : "f162dd28-c6a2-4357-a2ff-b942ba33d01e",
          "order_id" : "1554317097",
          "gross_amount" : "100000.00",
          "currency" : "IDR",
          "payment_type" : "bank_transfer",
          "transaction_time" : "2019-04-04 01:44:57",
          "transaction_status" : "pending",
          "fraud_status" : "accept",
          "permata_va_number" : "8778008906093609"
        }
    http_version: 
  recorded_at: Wed, 03 Apr 2019 18:44:57 GMT
- request:
    method: post
    uri: https://api.sandbox.midtrans.com/v2/1554317097/cancel
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - Veritrans ruby gem 2.3.0
      Authorization:
      - Basic VlQtc2VydmVyLTlIdGItUnhYa2c3LTdoem5TQ0NqeHZvWTo=
      Accept:
      - application/json
      Content-Type:
      - application/json
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 03 Apr 2019 18:44:58 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '374'
      Connection:
      - keep-alive
      Vary:
      - Accept-Encoding
      Cache-Control:
      - no-cache
      Pragma:
      - no-cache
      Expires:
      - Wed, 31 Dec 1969 17:00:00 GMT
      X-Kong-Upstream-Latency:
      - '56'
      X-Kong-Proxy-Latency:
      - '87'
      Via:
      - kong/0.14.0
      Strict-Transport-Security:
      - max-age=15724800; includeSubDomains;
    body:
      encoding: ASCII-8BIT
      string: |-
        {
          "status_code" : "200",
          "status_message" : "Success, transaction is canceled",
          "transaction_id" : "f162dd28-c6a2-4357-a2ff-b942ba33d01e",
          "order_id" : "1554317097",
          "gross_amount" : "100000.00",
          "currency" : "IDR",
          "payment_type" : "bank_transfer",
          "transaction_time" : "2019-04-04 01:44:57",
          "transaction_status" : "cancel",
          "fraud_status" : "accept"
        }
    http_version: 
  recorded_at: Wed, 03 Apr 2019 18:44:58 GMT
recorded_with: VCR 4.0.0
